#### ExportFontInfo Members

---

|  |
| --- |
| ExportFontInfo Class   Constructors   Methods   Properties   See Also |

The  ExportFontInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportFontInfo | Constructs a new default ExportFontInfo. |
| Public method | ExportFontInfo(String) | Constructs a new ExportFontInfo using the destination font name as input. |
| Public method | ExportFontInfo(ExportFontInfo) | Constructs a new copy of the input ExportFontInfo object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExportFontInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DestinationFontName | The destination font name (the name of the font in the exported format). |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExportFontInfo Class

Autodesk.Revit.DB Namespace